{
    "title": "About Us",
    "subtitle": "Philosophy and Members of Post-modern Cryptography Institute ZOMIA",
    "missionTitle": "Mission",
    "missionDescription": "ZOMIA is advancing research and development in next-generation cryptographic technologies, which we position as 'Post-modern Cryptography,' including quantum-resistant cryptography for the quantum computing era, the fusion of biometric authentication and cryptography, secure computation technologies, and verifiable computation including zero-knowledge proofs. In today's rapidly evolving technological society, protecting data privacy and securing communications are essential for safeguarding fundamental rights. We aim to achieve this mission through cutting-edge cryptographic technology.",
    "visionTitle": "Vision",
    "visionDescription": "ZOMIA envisions a future where cryptographic advancements enable all people to explore, interact, and create freely in the digital world while ensuring privacy and security. Our vision is for cryptographic technology to become seamlessly integrated into daily life and user-friendly for the general public. By establishing trust and safety in the digital realm, we contribute to the realization of a society that can maximize the benefits of technological advancement.",
    "teamTitle": "Team",
    "teamMembers": [
        {
            "name": "Team Member A",
            "role": "Founder & Representative",
            "bio": "Specializing in cryptographic theory at Waseda University Graduate School, they focus on zero-knowledge proofs and their applications. Previously worked as an engineer at a major IT company, involved in numerous projects. They have presented at domestic and international conferences and published papers to promote cryptographic technology.",
            "areas": [
                "Zero-Knowledge Proofs"
            ]
        },
        {
            "name": "Team Member B",
            "role": "Cryptography Researcher",
            "bio": "Specializing in advanced zero-knowledge proofs, they are conducting joint research with the Ethereum Foundation. They have a strong background in cryptographic algorithms and their applications.",
            "areas": [
                "Zero-Knowledge Proofs"
            ]
        },
        {
            "name": "Team Member C",
            "role": "ZK Engineer",
            "bio": "Working as an engineer at a blockchain company, they participate in projects related to the implementation of zero-knowledge proofs. They are particularly proficient in implementing zk-SNARKs and zk-STARKs.",
            "areas": [
                "Zero-Knowledge Proofs"
            ]
        }
    ],
    "joinUsTitle": "Work With Us",
    "joinUsDescription": "ZOMIA is always looking for talented individuals passionate about cryptography and security. We collaborate with researchers, engineers, cryptographic mathematicians, and professionals from various specialized fields to develop next-generation cryptographic technologies. If you're interested, please feel free to contact us.",
    "contactButton": "Contact Us"
}