{
    "title": "研究",
    "subtitle": "近未来暗号（Post-modern Cryptography）の研究",
    "introTitle": "近未来暗号とは",
    "introText": [
        "暗号の歴史を大きく振り返ると、「古典暗号」と「現代暗号」の二つに分けられます。",
        "「古典暗号」は、シーザー暗号、スキュタレー暗号、第二次世界大戦期のドイツのEnigma、旧日本軍の九七式欧文印字機などに代表されるように、「アルゴリズム自体」を秘匿する方式です。",
        "「現代暗号」は、AESやRSA暗号、楕円曲線暗号などのように、コンピュータ技術の発展によって確立された、「鍵」を秘密にし、暗号アルゴリズムを公開する方式です。現在のインターネットセキュリティのほとんどは、この現代暗号を基盤として成り立っています。",
        "しかし、現代暗号にはいくつかの課題が残されています。その最たる例は鍵管理の煩雑さです。",
        "そこで提唱したいのが、「鍵の形だけでなく、計算そのものの在り方や人間の存在（生体情報）も統合して安全を実現する」という新たな概念としての「近未来暗号（Post-modern Cryptography）」です。",
        "近未来暗号は、現代暗号の上位概念として、従来の「鍵を秘密にする」という枠組みをさらに押し広げ、人間自体が鍵として機能する仕組みや、プライバシー保護を前提とした計算アルゴリズムを組み込んでいきます。これにより、量子耐性や検証可能な計算手続きの実現を目指し、「鍵管理」という発想そのものを根本から変革する可能性を秘めています。"
    ],
    "researchAreas": [
        {
            "id": "biometric",
            "title": "生体暗号/認証",
            "description": "AIと人間を明確に区別するため、指紋や脳内署名など人間固有の情報を鍵として活用し、なりすましやボット対策を強化します。\n\n生体情報は一度漏洩すると変更が困難であるという課題がありますが、私たちは生体情報そのものを保存せず、その特徴から安全に鍵を生成する手法を研究しています。また、AIによる生体情報の模倣を検出する技術も開発中です。\n\n主な研究テーマ:\n• 生体情報からの安全な鍵生成\n• 生体情報の漏洩に耐性のある認証システム\n• AIと人間を区別するための暗号学的手法\n• 脳波や心拍などの生理的特徴を用いた認証"
        },
        {
            "id": "quantum",
            "title": "耐量子暗号",
            "description": "量子コンピュータの発展を前提とした暗号方式で、既存のRSAや楕円曲線暗号などを代替する新世代の安全性を目指します。\n\nGoogleの量子チップWillowなど、量子コンピュータの実用化が現実味を帯びる中、現代の暗号システムの多くが量子アルゴリズムによって破られる可能性があります。私たちは格子ベース、コードベース、多変数多項式ベース、ハッシュベースなど、量子コンピュータでも解読が困難とされる暗号方式の研究と実装を進めています。\n\n主な研究テーマ:\n• 格子ベース暗号の効率的な実装\n• 耐量子署名方式の開発\n• 量子鍵配送との併用による安全性強化\n• 既存システムへの耐量子暗号の段階的導入方法"
        },
        {
            "id": "mpc",
            "title": "秘密計算技術",
            "description": "ドローンや衛星、AIによる大規模監視下でも、個人や企業の機密データを保持したまま計算を行い、プライバシーを完全に保護します。\n\n秘密計算技術には、複数の当事者が互いにデータを明かさずに共同計算を行う多者間計算（MPC）、暗号化されたままデータを処理できる完全準同型暗号（FHE）、特定の機能のみを実行できる難読化技術（iO）などがあります。これらの技術により、データのプライバシーを保ちながら、AIの学習や分析、企業間の機密データ共有などが可能になります。\n\n主な研究テーマ:\n• 効率的な多者間計算プロトコルの開発\n• 完全準同型暗号の実用化に向けた高速化\n• プライバシー保護データマイニング\n• 秘密計算技術の産業応用（医療、金融、サプライチェーンなど）"
        },
        {
            "id": "zk",
            "title": "検証可能計算",
            "description": "ゼロ知識証明などの手法を用い、データの内容を明かさずに正当性だけを証明することで、信頼できない第三者とも安全に計算を協調します。\n\n検証可能計算技術により、計算の正確さを証明しながらもプライバシーを保護することが可能になります。特にゼロ知識証明（ZKP）は、ブロックチェーンのスケーラビリティ向上やプライバシー保護、身元証明などの分野で革新的な応用が期待されています。\n\n主な研究テーマ:\n• zkSNARKs、zkSTARKsなどの効率的なゼロ知識証明システム\n• ゼロ知識仮想マシン（zkVM）の開発\n• ブロックチェーンにおけるプライバシー保護と検証可能性の両立\n• 分散型アイデンティティにおけるゼロ知識証明の応用"
        }
    ]
}